In [3]:
import sqlite3

con = sqlite3.connect("tutorial.db")
cursor = con.cursor()

cursor.execute(
    """
        CREATE TABLE produtos (id, nome, valor)
    """
) # Criar tabela

cursor.execute (
    """
        INSERT INTO  produtos (id, nome, valor) 
            VALUES
        (3, 'Camisa', 102.50)
    """
) # Inserir dadods

cursor.execute(
    """
        SELECT * FROM produtos
    """
) # Consultas

print(cursor.fetchall())

con.commit()
con.close()

[(3, 'Camisa', 102.5)]

In [ ]:
import sqlite3
import pandas as pd

con = sqlite3.connect("tutorial.db")

query = """
        SELECT * FROM produtos
    """

df = pd.read_sql(query, con)

con.close()
df.head()

   id    nome  valor
0   3  Camisa  102.5